[
  {"id": "1", "text": "Agent: The Universidad Politécnica de Madrid (UPM) was founded in 1971."},
  {"id": "2", "text": "Agent: UPM is the oldest and largest technical university in Spain."},
  {"id": "3", "text": "Agent: UPM has four main campuses: Ciudad Universitaria, Montegancedo, South Vallecas, and Downtown Madrid."},
  {"id": "4", "text": "Agent: The Montegancedo Campus is designated as an International Campus of Excellence."},
  {"id": "5", "text": "Agent: UPM consists of 18 Schools and Faculties."},
  {"id": "6", "text": "Agent: The Rectorate is located in the Ramiro de Maeztu building in Ciudad Universitaria."},
  {"id": "7", "text": "Agent: UPM offers undergraduate, master, and PhD degrees in engineering and architecture."},
  {"id": "8", "text": "Agent: The minimum passing grade is 5. The maximum grade is 10."},
  {"id": "9", "text": "Agent: A grade of 10 with distinction is called Matricula de Honor."},
  {"id": "10", "text": "Agent: The academic year is divided into two semesters: autumn and spring."},
  {"id": "11", "text": "Agent: The autumn semester starts in September and ends in January."},
  {"id": "12", "text": "Agent: The spring semester starts in February and ends in June."},
  {"id": "13", "text": "Agent: Exams are typically held in January, June, and July."},
  {"id": "14", "text": "Agent: A standard bachelor degree requires 240 ECTS credits."},
  {"id": "15", "text": "Agent: A standard bachelor degree takes four years to complete."},
  {"id": "16", "text": "Agent: A master degree usually requires between 60 and 120 ECTS credits."},
  {"id": "17", "text": "Agent: Politécnica Virtual is the main online portal for students."},
  {"id": "18", "text": "Agent: Students use Politécnica Virtual to check grades and enroll in courses."},
  {"id": "19", "text": "Agent: Moodle is the e-learning platform used for course materials."},
  {"id": "20", "text": "Agent: UPM provides an official email address to all students ending in @alumnos.upm.es."},
  {"id": "21", "text": "Agent: Eduroam Wi-Fi is available across all UPM campuses."},
  {"id": "22", "text": "Agent: VPN access allows students to connect to UPM services from home."},
  {"id": "23", "text": "Agent: The ETSII (Industrial Engineering) is located on Paseo de la Castellana."},
  {"id": "24", "text": "Agent: The ETSIT (Telecommunications) is located in Ciudad Universitaria."},
  {"id": "25", "text": "Agent: The ETSIINF (Computer Engineering) is located at the Montegancedo Campus."},
  {"id": "26", "text": "Agent: The ETSIAE (Aeronautical Engineering) is located in Ciudad Universitaria."},
  {"id": "27", "text": "Agent: The ETSICCP (Civil Engineering) is located in Ciudad Universitaria."},
  {"id": "28", "text": "Agent: The ETSAM (Architecture) is located in Ciudad Universitaria."},
  {"id": "29", "text": "Agent: The ETSIST (Telecommunication Systems) is located at the South Campus (Vallecas)."},
  {"id": "30", "text": "Agent: The ETSIDI (Industrial Design) is located in the Downtown Madrid campus."},
  {"id": "31", "text": "Agent: UPM has the highest number of double degree agreements in Spain."},
  {"id": "32", "text": "Agent: The Erasmus+ program allows studying in Europe for one or two semesters."},
  {"id": "33", "text": "Agent: The Magalhães program connects UPM with Latin American universities."},
  {"id": "34", "text": "Agent: The ATHENS program offers intensive one-week courses in Europe."},
  {"id": "35", "text": "Agent: UPM is a member of the CESAER network of technical universities."},
  {"id": "36", "text": "Agent: UPM has a strategic partnership with Tongji University in China."},
  {"id": "37", "text": "Agent: The Language Center offers courses in English, German, French, and Chinese."},
  {"id": "38", "text": "Agent: Official language certification exams like TOEIC are held at UPM."},
  {"id": "39", "text": "Agent: English is the primary language for many master programs."},
  {"id": "40", "text": "Agent: International students can take Spanish courses at the Language Center."},
  {"id": "41", "text": "Agent: The UPM Library network has 16 library points across campuses."},
  {"id": "42", "text": "Agent: Ingenio is the search engine for the UPM digital library."},
  {"id": "43", "text": "Agent: Students can book study rooms through the library website."},
  {"id": "44", "text": "Agent: The library offers laptop loans for students."},
  {"id": "45", "text": "Agent: During exam periods, some libraries extend their opening hours."},
  {"id": "46", "text": "Agent: UPM has sports facilities including gyms and tennis courts."},
  {"id": "47", "text": "Agent: The South Campus has a large swimming pool."},
  {"id": "48", "text": "Agent: Students can join UPM sports teams for inter-university competitions."},
  {"id": "49", "text": "Agent: The Trofeo Rector is the internal sports league of UPM."},
  {"id": "50", "text": "Agent: Actúaupm is the entrepreneurship program for startups."},
  {"id": "51", "text": "Agent: UPM creates around 20 spin-off companies per year."},
  {"id": "52", "text": "Agent: The Innovatech workshop helps researchers market their technologies."},
  {"id": "53", "text": "Agent: UPM is a leader in patent applications among Spanish universities."},
  {"id": "54", "text": "Agent: The Center for Biomedical Technology (CTB) is a major research hub."},
  {"id": "55", "text": "Agent: The Center for Supercomputing (CESVIMA) houses the Magerit supercomputer."},
  {"id": "56", "text": "Agent: The Solar Energy Institute (IES) is located at UPM."},
  {"id": "57", "text": "Agent: UPM participates in the EELISA European University alliance."},
  {"id": "58", "text": "Agent: Tuition fees are set by the Community of Madrid."},
  {"id": "59", "text": "Agent: Scholarships are available from the Spanish Ministry of Education."},
  {"id": "60", "text": "Agent: UPM offers its own scholarships for international mobility."},
  {"id": "61", "text": "Agent: The Mentor Project connects senior students with freshmen."},
  {"id": "62", "text": "Agent: Each School has a Student Delegation (Delegación de Alumnos)."},
  {"id": "63", "text": "Agent: Cultural associations at UPM include theater, music, and cinema clubs."},
  {"id": "64", "text": "Agent: The Tuna is a traditional musical group of university students."},
  {"id": "65", "text": "Agent: UPM organizes an annual Employment Forum for job seekers."},
  {"id": "66", "text": "Agent: The COIE provides career guidance and internship opportunities."},
  {"id": "67", "text": "Agent: Internships can be curricular (for credit) or extracurricular."},
  {"id": "68", "text": "Agent: Companies can post job offers on the UPM Job Bank."},
  {"id": "69", "text": "Agent: The Final Degree Project (TFG) is mandatory for graduation."},
  {"id": "70", "text": "Agent: The Master Thesis (TFM) must be defended publicly."},
  {"id": "71", "text": "Agent: PhD programs usually take three to five years."},
  {"id": "72", "text": "Agent: UPM has a Code of Ethics for the university community."},
  {"id": "73", "text": "Agent: The Equality Unit promotes gender equality at UPM."},
  {"id": "74", "text": "Agent: UPM is committed to the Sustainable Development Goals (SDGs)."},
  {"id": "75", "text": "Agent: The Carbon Footprint project aims to reduce campus emissions."},
  {"id": "76", "text": "Agent: UPM has a Psychological Attention Service for students."},
  {"id": "77", "text": "Agent: The Disability Care Unit supports students with special needs."},
  {"id": "78", "text": "Agent: The University Ombudsman defends the rights of students."},
  {"id": "79", "text": "Agent: Public transport cards are discounted for students under 26."},
  {"id": "80", "text": "Agent: The Metro station for Ciudad Universitaria is Line 6."},
  {"id": "81", "text": "Agent: The Metro station for South Campus is Sierra de Guadalupe."},
  {"id": "82", "text": "Agent: A shuttle bus connects Montegancedo with the city."},
  {"id": "83", "text": "Agent: UPM alumni include several Nobel Prize laureates."},
  {"id": "84", "text": "Agent: The School of Mines is located in a historic building in Rios Rosas."},
  {"id": "85", "text": "Agent: The School of Forestry is located in Ciudad Universitaria."},
  {"id": "86", "text": "Agent: UPM collaborates with Airbus and other aerospace companies."},
  {"id": "87", "text": "Agent: The I&E (Innovation and Entrepreneurship) minor is popular."},
  {"id": "88", "text": "Agent: Students can print documents at the reprography centers."},
  {"id": "89", "text": "Agent: The UPM card is used for library loans and access control."},
  {"id": "90", "text": "Agent: Enrollment changes can be requested during the modification period."},
  {"id": "91", "text": "Agent: Part-time enrollment is allowed for working students."},
  {"id": "92", "text": "Agent: Visiting professors from top universities teach at UPM."},
  {"id": "93", "text": "Agent: UPM hosts the Summer School every July."},
  {"id": "94", "text": "Agent: The FabLab is a digital fabrication laboratory for students."},
  {"id": "95", "text": "Agent: Hackathons are frequently organized by student associations."},
  {"id": "96", "text": "Agent: The BEST (Board of European Students of Technology) has a UPM branch."},
  {"id": "97", "text": "Agent: UPM supports open access publishing for research."},
  {"id": "98", "text": "Agent: The Gateway to Engineering program helps high school students."},
  {"id": "99", "text": "Agent: UPM is consistently ranked as the top technical university in Spain."},
  {"id": "100", "text": "Agent: The motto of UPM is Technica Impendi Nationi."}
]